Revit 2026 API

# MassSurfaceDataArea Property

---

Area of the references that the MassSurfaceData provides properties for.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Area { get; }
```
```vb
Public ReadOnly Property Area As Double
	Get
```
```cpp
public:
property double Area {
	double get ();
}
```
```fsharp
member Area : float with get
```

#### Property Value

Double

If it is used, should be greater than zero. Otherwise, it will be zero.

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace